import { useTranslations } from 'next-intl';
import React from "react";

export default function Faq() {
    const t = useTranslations();

    return (
        <div className="container mt-[100px] mx-auto mb-40">
            <h2 className="text-center mb-20">Популярні питання</h2>
            <div>
                <div className="faq-question-answer">
                    {/* eslint-disable-next-line jsx-a11y/click-events-have-key-events,jsx-a11y/no-noninteractive-element-interactions */}
                    <h4 className="question cursor-pointer">
                        Де і як зберігається інформація, яку я внесу в DenTal Care?
                    </h4>
                    <span className="hidden"
                          dangerouslySetInnerHTML={{
                              __html: 'Cliniccards — це сервіс хмарного типу зберігання даних, отже вся інформація зберігається в хмарному середовищі. Для роботи з системою\n' +
                                  '                            Cliniccards використовується найнадійніший у світі сервер Amazon, що знаходиться в Німеччині, при цьому дані передаються у закодованому\n' +
                                  '                            вигляді по захищеному каналу https. Крім того, системою щодня автоматично створюється резервна копія даних (дзеркальна копія), тож ризик\n' +
                                  '                            втрати даних зводиться до нуля.<br><br>\n' +
                                  '                            Безумовні переваги зберігання даних у хмарі:<br>\n' +
                                  '                            <li><b>Економія</b> — місця, часу, грошей на закупівлю, встановлення, налаштування та обслуговування локального серверу в клініці</li>\n' +
                                  '                            <li><b>Захист від вірусних атак</b> — технології роботи серверу Amazon виключають можливість вірусної атаки та втрати даних через це.</li>\n' +
                                  '                            <li><b>Відсутність ризику втрати даних</b> — оскільки всі дані зберігаються в хмарі, ви отримуєте до них доступ, навіть у випадку виходу з ладу чи\n' +
                                  '                                втрати ваших пристроїв чи обладнання.</li>\n' +
                                  '                            <li><b>Можливість доступу з будь-якої точки світу</b> — хмарні технології розширюють географію вашої роботи в межах усього світу, на відміну від\n' +
                                  '                                програмного забезпечення, яке встановлюється локально на пристрої.</li><br>\n' +
                                  '                            Тож, як бачите, зберігання даних у хмарі не просто тренд — це єдине рішення, яке забезпечить вам найвищий рівень безпеки збереження даних\n' +
                                  '                            та надійності в роботі!'
                          }}
                    />
                    <span className="toggle-icon"/>
                </div>
                <div className="faq-question-answer">
                    {/* eslint-disable-next-line jsx-a11y/click-events-have-key-events,jsx-a11y/no-noninteractive-element-interactions */}
                    <h4 className="question cursor-pointer">
                        Чи можу я втратити доступ інформації, яку зберігаю в DenTal Care?
                    </h4>
                    <span className="hidden"
                          dangerouslySetInnerHTML={{
                              __html: 'Cliniccards — це сервіс хмарного типу зберігання даних, отже вся інформація зберігається в хмарному середовищі. Для роботи з системою\n' +
                                  '                            Cliniccards використовується найнадійніший у світі сервер Amazon, що знаходиться в Німеччині, при цьому дані передаються у закодованому\n' +
                                  '                            вигляді по захищеному каналу https. Крім того, системою щодня автоматично створюється резервна копія даних (дзеркальна копія), тож ризик\n' +
                                  '                            втрати даних зводиться до нуля.<br><br>\n' +
                                  '                            Безумовні переваги зберігання даних у хмарі:<br>\n' +
                                  '                            <li><b>Економія</b> — місця, часу, грошей на закупівлю, встановлення, налаштування та обслуговування локального серверу в клініці</li>\n' +
                                  '                            <li><b>Захист від вірусних атак</b> — технології роботи серверу Amazon виключають можливість вірусної атаки та втрати даних через це.</li>\n' +
                                  '                            <li><b>Відсутність ризику втрати даних</b> — оскільки всі дані зберігаються в хмарі, ви отримуєте до них доступ, навіть у випадку виходу з ладу чи\n' +
                                  '                                втрати ваших пристроїв чи обладнання.</li>\n' +
                                  '                            <li><b>Можливість доступу з будь-якої точки світу</b> — хмарні технології розширюють географію вашої роботи в межах усього світу, на відміну від\n' +
                                  '                                програмного забезпечення, яке встановлюється локально на пристрої.</li><br>\n' +
                                  '                            Тож, як бачите, зберігання даних у хмарі не просто тренд — це єдине рішення, яке забезпечить вам найвищий рівень безпеки збереження даних\n' +
                                  '                            та надійності в роботі!'
                          }}
                    />
                    <span className="toggle-icon"/>
                </div>
            </div>
        </div>
    );
}
